In [1]:
loading_date = '2024-01-01'
country = 'SG'
system = 'RLS'

In [9]:
import sys
sys.path.append(r"D:\code-repo\jupyterlab\FLIP_AUTOMATION\framework\magic\")

In [12]:
%load_ext jinja_sql_magic

Initialized Spark session with UTC timezone

In [13]:
%%sql
SELECT 1 AS test_value

   test_value
0           1

In [14]:
%%sql
SELECT current_date() AS now

          now
0  2024-10-20

In [15]:
%%sql
SELECT '{{ loading_date }}', '{{ country }}', current_date() AS now

   2024-01-01  SG         now
0  2024-01-01  SG  2024-10-20